{
  "name": "Auto Scaling & Load Balancing Essentials",
  "description": "Flashcards covering EC2 Auto Scaling and Elastic Load Balancing concepts for the AWS Cloud Practitioner exam.",
  "category": "Compute",
  "cards": [
    {
      "id": "9VZ81TQH5K",
      "front": "A retail company expects unpredictable traffic to its web application during promotional events. Which AWS feature can help ensure application availability while minimizing costs?",
      "back": "Amazon EC2 Auto Scaling enables dynamic scaling of instances based on demand, ensuring high availability and cost efficiency by adding or removing instances as needed.",
      "example": "During a flash sale, Auto Scaling adds 5 EC2 instances to handle the load, and scales back down when traffic normalizes.",
      "mnemonic": "Auto Scaling = Auto Add/Subtract EC2s",
      "category": "Compute",
      "subject": "Elastic Load Balancer",
      "course": "AWS Cloud Practitioner Essentials",
      "module": "Module 1",
      "difficulty": "beginner",
      "tags": ["Auto Scaling", "High Availability"],
      "createdOn": "2025-07-18",
      "glossary": [
        {
          "term": "Auto Scaling",
          "definition": "Automatically adjusts the number of EC2 instances in response to demand."
        },
        {
          "term": "EC2 Instance",
          "definition": "A virtual server in Amazon's Elastic Compute Cloud (EC2)."
        }
      ]
    },
    {
      "id": "X1LD7FQ2PA",
      "front": "Your application runs on multiple EC2 instances and you're noticing one instance handles more requests than others. Which service can help distribute traffic evenly?",
      "back": "Elastic Load Balancing distributes incoming application traffic across multiple targets, such as EC2 instances, to ensure no single instance is overwhelmed.",
      "example": "A web app with 4 EC2s uses Elastic Load Balancing to route user traffic evenly, reducing response times and downtime.",
      "mnemonic": "ELB = Even Load Balancer",
      "category": "Compute",
      "subject": "Elastic Load Balancer",
      "course": "AWS Cloud Practitioner Essentials",
      "module": "Module 1",
      "difficulty": "beginner",
      "tags": ["Load Balancer", "Traffic Distribution"],
      "createdOn": "2025-07-18",
      "glossary": [
        {
          "term": "Elastic Load Balancing",
          "definition": "Automatically distributes traffic across multiple targets in one or more Availability Zones."
        }
      ]
    },
    {
      "id": "QW9TZS7XJU",
      "front": "You’ve configured an Auto Scaling group with a minimum of 2 instances, a desired capacity of 3, and a maximum of 5. What happens when demand spikes significantly?",
      "back": "The Auto Scaling group will add instances up to the maximum of 5 to meet demand, but it will not exceed this limit unless manually reconfigured.",
      "example": "If traffic triples suddenly, EC2 Auto Scaling may launch 2 more instances to meet demand, but caps at 5.",
      "mnemonic": "Min-Desired-Max = Floor-Target-Ceiling",
      "category": "Compute",
      "subject": "Elastic Load Balancer",
      "course": "AWS Cloud Practitioner Essentials",
      "module": "Module 1",
      "difficulty": "intermediate",
      "tags": ["Scaling", "Capacity Planning"],
      "createdOn": "2025-07-18",
      "glossary": [
        {
          "term": "Desired Capacity",
          "definition": "The number of EC2 instances that should be running under normal conditions in an Auto Scaling group."
        }
      ]
    },
    {
      "id": "KB26EM4AVY",
      "front": "An app experiences a steady traffic increase every Monday morning. How can AWS Auto Scaling handle this predictable trend efficiently?",
      "back": "Predictive scaling can automatically schedule scaling actions in anticipation of demand based on historical data, ensuring resources are ready ahead of time.",
      "example": "Auto Scaling schedules the launch of 3 more instances every Monday at 7 AM before user load increases.",
      "mnemonic": "Predictive = Preemptive Scaling",
      "category": "Compute",
      "subject": "Elastic Load Balancer",
      "course": "AWS Cloud Practitioner Essentials",
      "module": "Module 1",
      "difficulty": "intermediate",
      "tags": ["Predictive Scaling", "Automation"],
      "createdOn": "2025-07-18",
      "glossary": [
        {
          "term": "Predictive Scaling",
          "definition": "Uses machine learning to schedule capacity ahead of demand."
        }
      ]
    },
    {
      "id": "LFUZRPH938",
      "front": "Why is Elastic Load Balancing often paired with EC2 Auto Scaling in high-availability architectures?",
      "back": "Because as EC2 Auto Scaling dynamically adds or removes instances, Elastic Load Balancing ensures that incoming traffic is evenly distributed across the currently available instances.",
      "example": "As new EC2s are launched during a sale, ELB updates traffic distribution automatically to include them.",
      "mnemonic": "ASG + ELB = Always Smart Growth",
      "category": "Compute",
      "subject": "Elastic Load Balancer",
      "course": "AWS Cloud Practitioner Essentials",
      "module": "Module 1",
      "difficulty": "beginner",
      "tags": ["High Availability", "Load Balancer"],
      "createdOn": "2025-07-18",
      "glossary": [
        {
          "term": "High Availability",
          "definition": "System design approach to ensure a service remains operational as demand changes."
        }
      ]
    }
  ]
}
