{
  "name": "Amazon VPC Fundamentals",
  "description": "Core concepts of creating and managing VPCs, subnets, and gateways for secure AWS networking",
  "category": "Networking",
  "cards": [
    {
      "id": "82e74cec23",
      "front": "Network ACLs are considered stateless. By default, they allow all traffic in and out of the subnet. In contrast, security groups are stateful. The default configurations of security groups block all inbound traffic and allow all outbound traffic.",
      "back": "Network ACLs (NACLs) are stateless and apply rules to both inbound and outbound traffic independently, while security groups are stateful and track connection states, blocking inbound by default and allowing all outbound.",
      "example": "A subnet uses a NACL to allow traffic from a specific IP range, while an associated security group controls access to an EC2 instance within that subnet.",
      "mnemonic": "NACL = Not Always Connected Logic; SG = Stateful Gatekeeper",
      "category": "Networking",
      "subject": "Amazon VPC: Security Groups vs NACLs",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["VPC", "security group", "NACL"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "a4beb62277",
      "front": "AWS creates a default VPC for the use of many services. However, if users configure a serverless service, AWS doesn’t require a VPC for networking purposes. The network is managed behind the scenes.",
      "back": "Serverless services like AWS Lambda do not require a VPC by default. AWS manages the network infrastructure behind the scenes, simplifying setup.",
      "example": "A Lambda function processes S3 events without needing a VPC because AWS handles the networking internally.",
      "mnemonic": "Serverless = Self-Managed Networking",
      "category": "Networking",
      "subject": "Networking with Serverless",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["serverless", "VPC", "networking"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "d0ac7f3dcc",
      "front": "With serverless services, such as AWS Lambda, users run code on demand without having to provision or manage servers.",
      "back": "AWS Lambda allows users to run code on demand without provisioning or managing any servers, representing the core concept of serverless architecture.",
      "example": "A developer writes a function to process image uploads, which runs automatically when a file is uploaded to S3.",
      "mnemonic": "Lambda = Launch Automatically, Manage Barely Any",
      "category": "Compute",
      "subject": "AWS Lambda and Serverless",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["Lambda", "serverless", "compute"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "261198a1dd",
      "front": "AWS Fargate is a serverless compute platform for either Amazon ECS or Amazon Elastic Kubernetes Service (Amazon EKS).",
      "back": "AWS Fargate enables users to run containers without managing servers, supporting both Amazon ECS and Amazon EKS.",
      "example": "A team runs a containerized web app on Fargate using ECS, without setting up or managing EC2 instances.",
      "mnemonic": "Fargate = Free from managing Gateways (infrastructure)",
      "category": "Compute",
      "subject": "AWS Fargate Overview",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["Fargate", "ECS", "serverless"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "7861db6e5e",
      "front": "Amazon EC2 provides a wide selection of instance types that are optimized to fit different use cases.",
      "back": "Amazon EC2 offers flexible instance types that vary in CPU, memory, storage, and network capacity, enabling tailored infrastructure choices.",
      "example": "A company selects EC2 compute-optimized instances to run high-performance analytics workloads.",
      "mnemonic": "EC2 = Elastic Choices 2 fit needs",
      "category": "Compute",
      "subject": "Introduction to Amazon EC2",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["EC2", "instances", "compute"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "4420145f73",
      "front": "Security groups are considered to be stateful resources. When users first create a security group, it has no inbound rules.",
      "back": "Security groups are stateful, meaning return traffic is automatically allowed. They start with no inbound rules, blocking all incoming traffic, but allow all outbound traffic by default.",
      "example": "A security group is configured to only allow HTTPS inbound traffic to a web server, while permitting all outbound traffic.",
      "mnemonic": "SG = Stateful Gate",
      "category": "Networking",
      "subject": "Security Groups in VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["security group", "VPC", "firewall"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "v8m2t3wzqp",
      "front": "You're tasked with creating a secure network boundary around your AWS resources. Which AWS service provides this functionality?",
      "back": "Amazon VPC creates an isolated virtual network that acts as a boundary around your AWS resources, controlling inbound and outbound traffic.",
      "example": "An employee directory app is hosted inside a VPC to ensure that only explicitly permitted traffic can access it.",
      "mnemonic": "VPC = Virtual Perimeter Control",
      "category": "Networking",
      "subject": "Introduction to Amazon VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["VPC", "network isolation", "security"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "f1b9k6tzxr",
      "front": "You need to divide your VPC's IP range into smaller networks with distinct access rules. What should you create?",
      "back": "Create subnets within your VPC. Subnets are smaller network segments used to isolate resources and manage availability and access.",
      "example": "A public subnet hosts a web server with internet access, while a private subnet hosts a database with no direct internet exposure.",
      "mnemonic": "Subnet = Segment the Net",
      "category": "Networking",
      "subject": "Introduction to Amazon VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["subnets", "VPC", "network segmentation"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "x7k3z2lnvp",
      "front": "You want your VPC resources to connect to the internet. What AWS component do you need to attach?",
      "back": "You must create and attach an internet gateway to your VPC to enable public internet connectivity.",
      "example": "An EC2 instance in a public subnet can serve a website only after an internet gateway is attached to the VPC and routing is configured.",
      "mnemonic": "IGW = Internet Gets Wired",
      "category": "Networking",
      "subject": "Introduction to Amazon VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "beginner",
      "tags": ["internet gateway", "connectivity", "VPC"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "z6nm4v9kqw",
      "front": "You want to securely connect your corporate data center to your AWS VPC. What should you use?",
      "back": "Use a virtual private gateway (VGW) on the AWS side and a customer gateway on your data center side to create a secure VPN connection.",
      "example": "A retail company connects its internal ERP system to AWS via VGW and customer gateway for secure data exchange.",
      "mnemonic": "VGW = VPN Gateway to AWS",
      "category": "Networking",
      "subject": "Introduction to Amazon VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "intermediate",
      "tags": ["VPN", "VGW", "hybrid connectivity"],
      "createdOn": "2025-07-08"
    },
    {
      "id": "r4jw5y7cxt",
      "front": "To improve fault tolerance, your architecture must remain operational if one Availability Zone fails. What VPC design principle supports this?",
      "back": "High availability is achieved by deploying resources in subnets across at least two Availability Zones within the same Region.",
      "example": "An EC2 web server in AZ A is mirrored in AZ B to maintain uptime if AZ A becomes unavailable.",
      "mnemonic": "HA = Host Across",
      "category": "Networking",
      "subject": "Introduction to Amazon VPC",
      "course": "AWS Cloud Technical Essentials",
      "module": "Module 2",
      "difficulty": "intermediate",
      "tags": ["high availability", "AZ", "redundancy"],
      "createdOn": "2025-07-08"
    }
  ]
}
